

while True:
    a, b, c = input("[계산기]\n숫자, 연산기호, 숫자를 공백을 두고 입력해주세요.\n더하기(+) 빼기(-) 곱하기(*) 나누기(/)\n거듭제곱(**) 몫(//) 나머지(%)\n종료를 원하시면 0 0 0을 입력해주세요.\n소수점은 둘째자리까지 반올림되어 표기됩니다.\n입력: ").split()
    # 설명문
    if a and b and c == "0": # 셋 다 0이면 실행 구민 (종료)
        print("[계산기가 종료되었습니다.]")
        break

    a = float(a) # 입력된 숫자들을 계산을 위해서 실수형으로 바꿈 구민
    c = float(c)

    if b == "+": # 기호에 따라 연산 방식을 바꿈
        result = a + c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "-":
        result = a - c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "*":
        result = a * c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "**":
        result = a ** c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "/":
        result = a / c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "//":
        result = a // c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")
    elif b == "%":
        result = a % c
        print("--------------------\n결과:", round(result, 2), "\n--------------------")